app/Models/TeamModel.php

UPDATE `cgpt_users` SET `ac_status` = 'blocked'
WHERE `uid` = 'e659814x'
---
        public function changeStatus($id, $user_status) {

                $builder = $this->db->table('cgpt_users');
                $builder->where('uid', $id);
                $builder->update(['ac_status' => $user_status]);

SELECT *
FROM `cgpt_users`
WHERE `email_id` = 'krytechws0007@gmail.com'
---
        public function checkLogin($email) {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('email_id', $email);

                $result = $builder->get();

SELECT *
FROM `cgpt_users`
WHERE `uid` = 'e065327y'
---
        public function getUserData($uid) {

                $builder = $this->db->table('cgpt_users');
                $builder->where('uid', $uid);

                $result = $builder->get();

SELECT *
FROM `cgpt_users`
WHERE `uid` = 'e065327y'
---
        public function getProfilePic($uid) {

                $builder = $this->db->table('cgpt_users');
                $builder->where('uid', $uid);

                $result = $builder->get();

SELECT *
FROM `cgpt_users`
WHERE `uid` = 'e065327y'
---
        public function getUserType($uid) {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('uid', $uid);

                $result = $builder->get();

SELECT *
FROM `cgpt_users`
WHERE `usr_type` = 'admin'
---
        public function getAdminDetails() {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('usr_type', 'admin');
                $result = $builder->get();

SELECT *
FROM `cgpt_users`
WHERE `usr_type` = 'team'
AND `on_status` = '0'
---
        public function getAllTeam() {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('usr_type', 'team');
                $builder->where('on_status', '0');
                $result = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `cgpt_users`
WHERE `ac_status` = 'inactive'
---
        public function getInactiveUsers() {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('ac_status', 'inactive');

                return $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `cgpt_users`
WHERE `ac_status` = 'active'
---
        public function getActiveUsers() {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('ac_status', 'active');

                return $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `cgpt_users`
WHERE `ac_status` = 'blocked'
---
        public function getBlockedUsers() {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('ac_status', 'blocked');

                return $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `cgpt_users`
WHERE `ac_status` = 'deleted'
---
        public function getArchivedUsers() {

                $builder = $this->db->table('cgpt_users');
                $builder->select('*');
                $builder->where('ac_status', 'deleted');

                return $builder->countAllResults();